//-------------------------------------------------------------------------------------
// 概要 : ユーザを登録、削除するフォームの入力チェック処理
//        　対象となる場合に警告表示をする
//-------------------------------------------------------------------------------------

//-------------------------------------------------------------------------------------
// 概要 : 「登録」ボタンを押下した際の処理
//-------------------------------------------------------------------------------------
function OnButtonClickAdd() {
  var AddContent = document.getElementsByClassName("input");

  //--社員番号の入力チェック------------------------------------
  // 未入力
  if(AddContent[0].value == ""){
    alert("社員番号を入力してください。");
    return false;    //送信ボタン本来の動作をキャンセルする
  }

  // 数値以外での入力時の処理
  else if(isNaN(AddContent[0].value) == true){
    alert("社員番号は半角数字で入力してください。");
    return false;    //送信ボタン本来の動作をキャンセルする
  }

  // 6文字でないの入力時の処理
  else if(AddContent[0].value.length != 6){
    alert("社員番号は6文字で入力してください。")
    return false;   //送信ボタン本来の動作をキャンセルする
  }

  //--氏名----------------------------------------------------
  // 未入力
  if(AddContent[1].value == ""){
    alert("氏名を入力してください。")
    return false;
  }

  //--所属部署---------------------------------------------------
  // 未入力
  if(AddContent[2].value == ""){
    alert("所属部署を選択してください。")
    return false;  //送信ボタン本来の動作をキャンセルする
  }

  //--パスワード
  // 未入力
  if(AddContent[3].value == ""){
    alert("パスワードを入力してください。")
    return false;  //送信ボタン本来の動作をキャンセルする
  }

  return true;  //送信ボタン本来の動作をする

}

//-------------------------------------------------------------------------------------
// 概要 : 「削除」ボタンを押下した際の処理
//-------------------------------------------------------------------------------------
function OnButtonClickDelete() {
  var DeleteContent = document.getElementsByClassName("input");

  //--社員番号の入力チェック------------------------------------
  // 未入力
  if(DeleteContent[0].value == ""){
    alert("社員番号を入力してください。");
    return false;    //送信ボタン本来の動作をキャンセルする
  }

  // 数値以外での入力時の処理
  else if(isNaN(DeleteContent[0].value) == true){
    alert("社員番号は半角数字で入力してください。");
    return false;    //送信ボタン本来の動作をキャンセルする
  }

  // 6文字でないの入力時の処理
  else if(DeleteContent[0].value.length != 6){
    alert("社員番号は6文字で入力してください。")
    return false;   //送信ボタン本来の動作をキャンセルする
  }

  return true;  //送信ボタン本来の動作をする

}
